###################################################################

# Created by write_sdc on Tue May 7 10:47:19 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_operating_conditions -analysis_type bc_wc -max worst -max_library smic18_ss -min best -min_library smic18_ff
set_wire_load_mode segmented
set_wire_load_model -name reference_area_10000000 -library smic18_ss
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[23]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[22]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[21]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[20]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[19]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[18]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[17]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[16]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[15]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[14]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[13]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[12]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[11]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[10]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[9]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[8]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[7]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[6]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[5]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[4]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[3]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[2]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {rgb_data[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[7]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[6]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[5]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[4]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[3]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[2]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {led_num[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports write]
set_load -pin_load 0.0522168 [get_ports data]
set_ideal_network [get_ports reset]
create_clock [get_ports clk]  -name wb_clk  -period 83.3  -waveform {0 41.65}
set_clock_uncertainty 0.1  [get_clocks wb_clk]
set_false_path   -from [get_ports reset]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[23]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[22]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[21]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[20]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[19]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[18]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[17]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[16]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[15]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[14]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[13]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[12]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[11]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[10]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[9]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[8]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[7]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[6]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[5]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[4]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[3]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[2]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[1]}]
set_input_delay -clock wb_clk  41.65  [get_ports {rgb_data[0]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[7]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[6]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[5]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[4]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[3]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[2]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[1]}]
set_input_delay -clock wb_clk  41.65  [get_ports {led_num[0]}]
set_input_delay -clock wb_clk  41.65  [get_ports write]
set_output_delay -clock wb_clk  41.65  [get_ports data]
